Autodesk.Revit.DB.HasValueFilterRule.#ctor(Autodesk.Revit.DB.ElementId)
constructs an instance of HasValueFilterRule.
parameter:
The parameter that an element must have a value for to pass this rule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.HasValueFilterRule
Tests whether an element's parameter has a value.
Since:
2020